["A can do a piece of work in 20 days. B can do it in 10 days. If they work together in how many days they will finish the work.", "A alone can do assignment in 10 days. B can do it 15 days. If A and B work together in how many days they will finish the work.", "A and B together can finish the work in 10 days. B can do it in 40 days. If A works alone in how many days he will finish the work.", "A and B together can finish the work in 20 days. A alone can finish in 30 days. If B works alone in how many days he will finish the work.", "A can finish the work in 10 days.B can do it in 30 days.C can do it in 20 days.If they work together in how many days they will finish the work.", "A and B can finish the work in 20 days. C alone can do it in 50 days. If they work together in how many days they will finish the work.", "A and B can finish the work in 10 days. B and C can do it in 20 days. A and C can do it in 15 days. If they all work together in how many days they can finish the work.", "A, B and C together can finish a work in 20 days. A and B can do it in 30 days. If C works alone in how many days he will finish the job.", "A, B and C together can finish a work in 20 days. A can do it in 30 days. If B and C works together in how many days they will finish the job.", "A can do a job in 10 days. B can do it in 15 days. If they work together for 3 days, how much amount of work is remaining.", "A can do a job in 10 days. B can do it in 15 days. C can do it in 30 days.  If they work together for 3 days, what fraction of work is remaining.", "A and B can do a job in 10 days. B and C can do it in 30 days. A and C can do it in 40 days. If they work together in how many days they will finish the job.", "A and B can do a job in 10 days. B and C can do it in 30 days. A and C can do it in 40 days. If they work together for 2 days, how many days are remaining to finish the work.", "A and B can do a job in 10 days. B and C can do it in 30 days. A and C can do it in 40 days. If they work together for 1 days, what fraction of work is remaining.", "A and B can do a job in 10 days. B and C can do it in 30 days. A and C can do it in 40 days. If A, B and C work together in how many days they will finish the job.", "A can do a piece of work in 20 days. B can do it in 10 days. If A and B work together in how many days they will finish the work?", "A can do a piece of work in 20 days. B can do it in 10 days. If they work together for 2 days, how many days are remaining to finish the work.", "A can do a piece of work in 20 days. B can do it in 10 days. If they work together for 2 days, what fraction of work is remaining.", "A and B can do a work in 30 days. B can do it in 40 days. If A works alone in how many days he will finish the job.", "A, B and C can do a work in 30 days. B can do it in 45 days. C can do it in 70 days. If A works alone in how many days he will finish the job.", "A can do a piece of work in 40 days. B can do it in 10 days. If they work together in how many days they will finish the work.", "A alone can do assignment in 100 days. B can do it 150 days. If A and B work together in how many days they will finish the work.", "A and B together can finish the work in 10 days. B can do it in 30 days. If A works alone in how many days he will finish the work.", "A and B together can finish the work in 10 days. A alone can finish in 30 days. If B works alone in how many days he will finish the work.", "A can finish the work in 100 days.B can do it in 80 days.C can do it in 60 days.If they work together in how many days they will finish the work.", "A and B can finish the work in 20 days. C alone can do it in 40 days. If they work together in how many days they will finish the work.", "A and B can finish the work in 20 days. B and C can do it in 50 days. A and C can do it in 15 days. If they all work together in how many days they can finish the work.", "A, B and C together can finish a work in 20 days. A and B can do it in 30 days. If C works alone in how many days he will finish the job.", "A, B and C together can finish a work in 20 days. A can do it in 30 days. If B and C works together in how many days they will finish the job.", "A can do a job in 10 days. B can do it in 15 days. If they work together for 3 days, how much amount of work is remaining.", "A can do a job in 10 days. B can do it in 15 days. C can do it in 30 days.  If they work together for 3 days, what fraction of work is remaining.", "A and B can do a job in 40 days. B and C can do it in 30 days. A and C can do it in 50 days. If they work together in how many days they will finish the job.", "A and B can do a job in 50 days. B and C can do it in 30 days. A and C can do it in 30 days. If they work together for 2 days, how many days are remaining to finish the work.", "A and B can do a job in 20 days. B and C can do it in 30 days. A and C can do it in 20 days. If they work together for 1 days, what fraction of work is remaining.", "A and B can do a job in 70 days. B and C can do it in 30 days. A and C can do it in 40 days. If A, B and C work together in how many days they will finish the job.", "A can do a piece of work in 80 days. B can do it in 10 days. If A and B work together in how many days they will finish the work?", "A can do a piece of work in 20 days. B can do it in 10 days. If they work together for 3 days, how many days are remaining to finish the work.", "A can do a piece of work in 50 days. B can do it in 10 days. If they work together for 1 days, what fraction of work is remaining.", "A and B can do a work in 20 days. B can do it in 60 days. If A works alone in how many days he will finish the job.", "A, B and C can do a work in 10 days. B can do it in 50 days. C can do it in 30 days. If A works alone in how many days he will finish the job."]